org/qmckl_electron.org
#+TITLE: Electrons
#+SETUPFILE: ../tools/theme.setup
#+INCLUDE: ../tools/lib.org

In conventional QMC simulations, up-spin and down-spin electrons are
different. The ~electron~  data structure contains the number of
up-spin and down-spin electrons, and the electron coordinates.

* Headers                                                          :noexport:
  #+begin_src elisp :noexport :results none
(org-babel-lob-ingest "../tools/lib.org")
#+end_src


  #+begin_src c :tangle (eval h_private_type)
#ifndef QMCKL_ELECTRON_HPT
#define QMCKL_ELECTRON_HPT
#include <stdbool.h>
  #+end_src

  #+begin_src c :tangle (eval c_test) :noweb yes
#include "qmckl.h"
#include <assert.h>
#include <math.h>
#ifdef HAVE_CONFIG_H
#include "config.h"
#endif

#include "chbrclf.h"

int main() {
  qmckl_context context;
  context = qmckl_context_create();
  #+end_src

  #+begin_src c :tangle (eval c)
#ifdef HAVE_CONFIG_H
#include "config.h"
#endif

#ifdef HAVE_STDINT_H
#include <stdint.h>
#elif HAVE_INTTYPES_H
#include <inttypes.h>
#endif

#include <stdlib.h>
#include <string.h>
#include <stdbool.h>
#include <assert.h>
#include <math.h>

#include <stdio.h>

#include "qmckl.h"
#include "qmckl_context_private_type.h"
#include "qmckl_memory_private_type.h"
#include "qmckl_memory_private_func.h"
#include "qmckl_electron_private_func.h"
  #+end_src

* Context

  The following data stored in the context:

   | ~uninitialized~                     | ~int32_t~                         | Keeps bit set for uninitialized data                                 |
   | ~num~                               | ~int64_t~                         | Total number of electrons                                            |
   | ~up_num~                            | ~int64_t~                         | Number of up-spin electrons                                          |
   | ~down_num~                          | ~int64_t~                         | Number of down-spin electrons                                        |
   | ~walk_num~                          | ~int64_t~                         | Number of walkers                                                    |
   | ~rescale_factor_kappa_ee~           | ~double~                          | The distance scaling factor                                          |
   | ~rescale_factor_kappa_en~           | ~double~                          | The distance scaling factor                                          |
   | ~provided~                          | ~bool~                            | If true, ~electron~ is valid                                         |
   | ~coord_new~                         | ~double[walk_num][3][num]~        | New set of electron coordinates                                      |
   | ~coord_old~                         | ~double[walk_num][3][num]~        | Old set of electron coordinates                                      |
   | ~coord_new_date~                    | ~uint64_t~                        | Last modification date of the coordinates                            |
   | ~ee_distance~                       | ~double[walk_num][num][num]~      | Electron-electron distances                                          |
   | ~ee_distance_date~                  | ~uint64_t~                        | Last modification date of the electron-electron distances            |
   | ~en_distance~                       | ~double[walk_num][nucl_num][num]~ | Electron-nucleus distances                                           |
   | ~en_distance_date~                  | ~uint64_t~                        | Last modification date of the electron-electron distances            |
   | ~ee_distance_rescaled~              | ~double[walk_num][num][num]~      | Electron-electron rescaled distances                                 |
   | ~ee_distance_rescaled_date~         | ~uint64_t~                        | Last modification date of the electron-electron distances            |
   | ~ee_distance_rescaled_deriv_e~      | ~double[walk_num][4][num][num]~   | Electron-electron rescaled distances derivatives                     |
   | ~ee_distance_rescaled_deriv_e_date~ | ~uint64_t~                        | Last modification date of the electron-electron distance derivatives |
   | ~en_distance_rescaled~              | ~double[walk_num][nucl_num][num]~ | Electron-nucleus distances                                           |
   | ~en_distance_rescaled_date~         | ~uint64_t~                        | Last modification date of the electron-electron distances            |
   | ~en_distance_rescaled_deriv_e~      | ~double[walk_num][4][num][num]~   | Electron-electron rescaled distances derivatives                     |
   | ~en_distance_rescaled_deriv_e_date~ | ~uint64_t~                        | Last modification date of the electron-electron distance derivatives |


