qmckl_electron.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-11 Mon 22:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Electrons</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="TREX CoE" />
<link rel="stylesheet" title="Standard" href="qmckl.css" type="text/css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Electrons</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0283b94">1. Context</a>
<ul>
<li><a href="#org4204106">1.1. Data structure</a></li>
<li><a href="#org0bace51">1.2. Access functions</a>
<ul>
<li><a href="#orga3968ba">1.2.1. Number of electrons</a></li>
<li><a href="#org4f138ea">1.2.2. Number of walkers</a></li>
<li><a href="#orgcdd4d86">1.2.3. Scaling factors Kappa</a></li>
<li><a href="#org6c46b68">1.2.4. Electron coordinates</a></li>
</ul>
</li>
<li><a href="#org1022463">1.3. Initialization functions</a></li>
<li><a href="#org08032fb">1.4. Test</a></li>
</ul>
</li>
<li><a href="#orgc91aa4e">2. Computation</a>
<ul>
<li><a href="#org77c271e">2.1. Electron-electron distances</a>
<ul>
<li><a href="#org100be8f">2.1.1. Get</a></li>
<li><a href="#org8b0431e">2.1.2. Compute</a></li>
<li><a href="#orgbb5bead">2.1.3. Test</a></li>
</ul>
</li>
<li><a href="#org536fda3">2.2. Electron-electron rescaled distances</a>
<ul>
<li><a href="#org51511b5">2.2.1. Get</a></li>
<li><a href="#org43cfce8">2.2.2. Compute</a></li>
<li><a href="#org479e745">2.2.3. Test</a></li>
</ul>
</li>
<li><a href="#orgd201a04">2.3. Electron-electron rescaled distance gradients and laplacian with respect to electron coords</a>
<ul>
<li><a href="#org4b5646b">2.3.1. Get</a></li>
<li><a href="#org8150b7f">2.3.2. Compute</a></li>
<li><a href="#org7d71d8e">2.3.3. Test</a></li>
</ul>
</li>
<li><a href="#org6f2c7a4">2.4. Electron-nucleus distances</a>
<ul>
<li><a href="#orgf5e8e8c">2.4.1. Get</a></li>
<li><a href="#org9aeff70">2.4.2. Compute</a></li>
<li><a href="#org434cb8f">2.4.3. Test</a></li>
</ul>
</li>
<li><a href="#org240cf6a">2.5. Electron-nucleus rescaled distances</a>
<ul>
<li><a href="#orge00b3a1">2.5.1. Get</a></li>
<li><a href="#org0f96d99">2.5.2. Compute</a></li>
<li><a href="#org407532b">2.5.3. Test</a></li>
</ul>
</li>
<li><a href="#org89a6080">2.6. Electron-nucleus rescaled distance gradients and laplacian with respect to electron coords</a>
<ul>
<li><a href="#orgb164a99">2.6.1. Get</a></li>
<li><a href="#orgd44c85b">2.6.2. Compute</a></li>
<li><a href="#org1ce60b1">2.6.3. Test</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org0283b94" class="outline-2">
<h2 id="org0283b94"><span class="section-number-2">1</span> Context</h2>
<div class="outline-text-2" id="text-1">
<p>
The following data stored in the context:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>uninitialized</code></td>
<td class="org-left"><code>int32_t</code></td>
<td class="org-left">Keeps bit set for uninitialized data</td>
</tr>

<tr>
<td class="org-left"><code>num</code></td>
<td class="org-left"><code>int64_t</code></td>
<td class="org-left">Total number of electrons</td>
</tr>

<tr>
<td class="org-left"><code>up_num</code></td>
<td class="org-left"><code>int64_t</code></td>
<td class="org-left">Number of up-spin electrons</td>
</tr>

<tr>
<td class="org-left"><code>down_num</code></td>
<td class="org-left"><code>int64_t</code></td>
<td class="org-left">Number of down-spin electrons</td>
</tr>

<tr>
<td class="org-left"><code>walk_num</code></td>
<td class="org-left"><code>int64_t</code></td>
<td class="org-left">Number of walkers</td>
</tr>

<tr>
<td class="org-left"><code>rescale_factor_kappa_ee</code></td>
<td class="org-left"><code>double</code></td>
<td class="org-left">The distance scaling factor</td>
</tr>

<tr>
<td class="org-left"><code>rescale_factor_kappa_en</code></td>
<td class="org-left"><code>double</code></td>
<td class="org-left">The distance scaling factor</td>
</tr>

<tr>
<td class="org-left"><code>provided</code></td>
<td class="org-left"><code>bool</code></td>
<td class="org-left">If true, <code>electron</code> is valid</td>
</tr>

<tr>
<td class="org-left"><code>coord_new</code></td>
<td class="org-left"><code>double[walk_num][3][num]</code></td>
<td class="org-left">New set of electron coordinates</td>
</tr>

<tr>
<td class="org-left"><code>coord_old</code></td>
<td class="org-left"><code>double[walk_num][3][num]</code></td>
<td class="org-left">Old set of electron coordinates</td>
</tr>

<tr>
<td class="org-left"><code>coord_new_date</code></td>
<td class="org-left"><code>uint64_t</code></td>
<td class="org-left">Last modification date of the coordinates</td>
</tr>

<tr>
<td class="org-left"><code>ee_distance</code></td>
<td class="org-left"><code>double[walk_num][num][num]</code></td>
<td class="org-left">Electron-electron distances</td>
</tr>

<tr>
<td class="org-left"><code>ee_distance_date</code></td>
<td class="org-left"><code>uint64_t</code></td>
<td class="org-left">Last modification date of the electron-electron distances</td>
</tr>

<tr>
<td class="org-left"><code>en_distance</code></td>
<td class="org-left"><code>double[walk_num][nucl_num][num]</code></td>
<td class="org-left">Electron-nucleus distances</td>
</tr>

<tr>
<td class="org-left"><code>en_distance_date</code></td>
<td class="org-left"><code>uint64_t</code></td>
<td class="org-left">Last modification date of the electron-electron distances</td>
</tr>

<tr>
<td class="org-left"><code>ee_distance_rescaled</code></td>
<td class="org-left"><code>double[walk_num][num][num]</code></td>
<td class="org-left">Electron-electron rescaled distances</td>
</tr>

<tr>
<td class="org-left"><code>ee_distance_rescaled_date</code></td>
<td class="org-left"><code>uint64_t</code></td>
<td class="org-left">Last modification date of the electron-electron distances</td>
</tr>

<tr>
<td class="org-left"><code>ee_distance_rescaled_deriv_e</code></td>
<td class="org-left"><code>double[walk_num][4][num][num]</code></td>
<td class="org-left">Electron-electron rescaled distances derivatives</td>
</tr>

<tr>
<td class="org-left"><code>ee_distance_rescaled_deriv_e_date</code></td>
<td class="org-left"><code>uint64_t</code></td>
<td class="org-left">Last modification date of the electron-electron distance derivatives</td>
</tr>

<tr>
<td class="org-left"><code>en_distance_rescaled</code></td>
<td class="org-left"><code>double[walk_num][nucl_num][num]</code></td>
<td class="org-left">Electron-nucleus distances</td>
</tr>

<tr>
<td class="org-left"><code>en_distance_rescaled_date</code></td>
<td class="org-left"><code>uint64_t</code></td>
<td class="org-left">Last modification date of the electron-electron distances</td>
</tr>

<tr>
<td class="org-left"><code>en_distance_rescaled_deriv_e</code></td>
<td class="org-left"><code>double[walk_num][4][nucl_num][num]</code></td>
<td class="org-left">Electron-electron rescaled distances derivatives</td>
</tr>

<tr>
<td class="org-left"><code>en_distance_rescaled_deriv_e_date</code></td>
<td class="org-left"><code>uint64_t</code></td>
<td class="org-left">Last modification date of the electron-electron distance derivatives</td>
</tr>
</tbody>
</table>
</div>
