qmckl_electron.html

<div id="outline-container-org4204106" class="outline-3">
<h3 id="org4204106"><span class="section-number-3">1.1</span> Data structure</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">qmckl_electron_struct</span> {
  <span style="color: #228b22;">int64_t</span>   <span style="color: #a0522d;">num</span>;
  <span style="color: #228b22;">int64_t</span>   <span style="color: #a0522d;">up_num</span>;
  <span style="color: #228b22;">int64_t</span>   <span style="color: #a0522d;">down_num</span>;
  <span style="color: #228b22;">int64_t</span>   <span style="color: #a0522d;">walk_num</span>;
  <span style="color: #228b22;">double</span>    <span style="color: #a0522d;">rescale_factor_kappa_ee</span>;
  <span style="color: #228b22;">double</span>    <span style="color: #a0522d;">rescale_factor_kappa_en</span>;
  <span style="color: #228b22;">int64_t</span>   <span style="color: #a0522d;">coord_new_date</span>;
  <span style="color: #228b22;">int64_t</span>   <span style="color: #a0522d;">ee_distance_date</span>;
  <span style="color: #228b22;">int64_t</span>   <span style="color: #a0522d;">en_distance_date</span>;
  <span style="color: #228b22;">int64_t</span>   <span style="color: #a0522d;">ee_distance_rescaled_date</span>;
  <span style="color: #228b22;">int64_t</span>   <span style="color: #a0522d;">ee_distance_rescaled_deriv_e_date</span>;
  <span style="color: #228b22;">int64_t</span>   <span style="color: #a0522d;">en_distance_rescaled_date</span>;
  <span style="color: #228b22;">int64_t</span>   <span style="color: #a0522d;">en_distance_rescaled_deriv_e_date</span>;
  <span style="color: #228b22;">double</span>*   <span style="color: #a0522d;">coord_new</span>;
  <span style="color: #228b22;">double</span>*   <span style="color: #a0522d;">coord_old</span>;
  <span style="color: #228b22;">double</span>*   <span style="color: #a0522d;">ee_distance</span>;
  <span style="color: #228b22;">double</span>*   <span style="color: #a0522d;">en_distance</span>;
  <span style="color: #228b22;">double</span>*   <span style="color: #a0522d;">ee_distance_rescaled</span>;
  <span style="color: #228b22;">double</span>*   <span style="color: #a0522d;">ee_distance_rescaled_deriv_e</span>;
  <span style="color: #228b22;">double</span>*   <span style="color: #a0522d;">en_distance_rescaled</span>;
  <span style="color: #228b22;">double</span>*   <span style="color: #a0522d;">en_distance_rescaled_deriv_e</span>;
  <span style="color: #228b22;">int32_t</span>   <span style="color: #a0522d;">uninitialized</span>;
  <span style="color: #228b22;">bool</span>      <span style="color: #a0522d;">provided</span>;
} <span style="color: #228b22;">qmckl_electron_struct</span>;

</pre>
</div>

<p>
The <code>uninitialized</code> integer contains one bit set to one for each
initialization function which has not been called. It becomes equal
to zero after all initialization functions have been called. The
struct is then initialized and <code>provided == true</code>.
Some values are initialized by default, and are not concerned by
this mechanism.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #0000ff;">qmckl_init_electron</span>(<span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #0000ff;">qmckl_init_electron</span>(<span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>) {

  <span style="color: #a020f0;">if</span> (qmckl_context_check(context) == QMCKL_NULL_CONTEXT) {
    <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">false</span>;
  }

  <span style="color: #228b22;">qmckl_context_struct</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">ctx</span> = (<span style="color: #228b22;">qmckl_context_struct</span>* <span style="color: #a020f0;">const</span>) context;
  assert (ctx != <span style="color: #008b8b;">NULL</span>);

  ctx-&gt;electron.uninitialized = (1 &lt;&lt; 2) - 1;

  /* <span style="color: #b22222;">Default values </span>*/
  ctx-&gt;electron.rescale_factor_kappa_ee = 1.0;
  ctx-&gt;electron.rescale_factor_kappa_en = 1.0;

  <span style="color: #a020f0;">return</span> QMCKL_SUCCESS;
}
</pre>
</div>


<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">bool</span> <span style="color: #0000ff;">qmckl_electron_provided</span> (<span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>);
</pre>
</div>
</div>
</div>

<div id="outline-container-org0bace51" class="outline-3">
<h3 id="org0bace51"><span class="section-number-3">1.2</span> Access functions</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Access functions return <code>QMCKL_SUCCESS</code> when the data has been
successfully retrieved. It returnes <code>QMCKL_INVALID_CONTEXT</code> when
the context is not a valid context, and <code>QMCKL_NOT_PROVIDED</code> when
the data has not been provided. If the function returns
successfully, the variable pointed by the pointer given in argument
contains the requested data. Otherwise, this variable is untouched.
</p>
</div>

<div id="outline-container-orga3968ba" class="outline-4">
<h4 id="orga3968ba"><span class="section-number-4">1.2.1</span> Number of electrons</h4>
</div>

<div id="outline-container-org4f138ea" class="outline-4">
<h4 id="org4f138ea"><span class="section-number-4">1.2.2</span> Number of walkers</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
A walker is a set of electron coordinates that are arguments of
the wave function. <code>walk_num</code> is the number of walkers.
</p>
</div>
</div>

<div id="outline-container-orgcdd4d86" class="outline-4">
<h4 id="orgcdd4d86"><span class="section-number-4">1.2.3</span> Scaling factors Kappa</h4>
</div>
