org/qmckl_electron.org
*** Electron coordinates

    Returns the current electron coordinates. The pointer is assumed
    to point on a memory block of size ~3 * elec_num * walk_num~. 
    The order of the indices is:

    |         | Normal                    | Transposed                |
    |---------+---------------------------+---------------------------|
    | C       | ~[walk_num][elec_num][3]~ | ~[walk_num][3][elec_num]~ |
    | Fortran | ~(3,elec_num,walk_num)~   | ~(elec_num,3,walk_num)~   |


      #+begin_src c :comments org :tangle (eval h_func) :exports none
qmckl_exit_code qmckl_get_electron_coord (const qmckl_context context, const char transp, double* const coord);
      #+end_src

      #+begin_src c :comments org :tangle (eval c) :noweb yes :exports none
qmckl_exit_code
qmckl_get_electron_coord (const qmckl_context context, const char transp, double* const coord) {

  if (qmckl_context_check(context) == QMCKL_NULL_CONTEXT) {
    return QMCKL_INVALID_CONTEXT;
  }

  if (transp != 'N' && transp != 'T') {
    return qmckl_failwith( context,
                           QMCKL_INVALID_ARG_2,
                           "qmckl_get_electron_coord",
                           "transp should be 'N' or 'T'");
  }

  if (coord == NULL) {
    return qmckl_failwith( context,
                           QMCKL_INVALID_ARG_3,
                           "qmckl_get_electron_coord",
                           "coord is a null pointer");
  }

  qmckl_context_struct* const ctx = (qmckl_context_struct* const) context;
  assert (ctx != NULL);

  if ( !(ctx->electron.provided) ) {
    return qmckl_failwith( context,
                           QMCKL_NOT_PROVIDED,
                           "qmckl_get_electron_coord",
                           "electron data is not provided");
  }

  int64_t elec_num = ctx->electron.num;
  int64_t walk_num = ctx->electron.walk_num;

  assert (ctx->electron.coord_new != NULL);

  double* ptr1 = ctx->electron.coord_new;
  double* ptr2 = coord;

  if (transp == 'N') {

    for (int64_t i=0 ; i<walk_num ; ++i) {
      qmckl_exit_code rc;
      rc = qmckl_transpose(context, elec_num, 3,
                           ptr1, elec_num, ptr2, 3);
      if (rc != QMCKL_SUCCESS) return rc;
      ptr1 += elec_num * 3;
      ptr2 += elec_num * 3;
    }

  } else {

    memcpy(ptr2, ptr1, 3*elec_num*walk_num*sizeof(double));

  }
  
  return QMCKL_SUCCESS;
}

      #+end_src

