qmckl_electron.html

<div id="outline-container-org6c46b68" class="outline-4">
<h4 id="org6c46b68"><span class="section-number-4">1.2.4</span> Electron coordinates</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
Returns the current electron coordinates. The pointer is assumed
to point on a memory block of size <code>3 * elec_num * walk_num</code>. 
The order of the indices is:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Normal</th>
<th scope="col" class="org-left">Transposed</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C</td>
<td class="org-left"><code>[walk_num][elec_num][3]</code></td>
<td class="org-left"><code>[walk_num][3][elec_num]</code></td>
</tr>

<tr>
<td class="org-left">Fortran</td>
<td class="org-left"><code>(3,elec_num,walk_num)</code></td>
<td class="org-left"><code>(elec_num,3,walk_num)</code></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
