qmckl_electron.html

<div id="outline-container-org08032fb" class="outline-3">
<h3 id="org08032fb"><span class="section-number-3">1.4</span> Test</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-c">/* <span style="color: #b22222;">Reference input data </span>*/
<span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">walk_num</span>      = chbrclf_walk_num;
<span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">elec_num</span>      = chbrclf_elec_num;
<span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">elec_up_num</span>   = chbrclf_elec_up_num;
<span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">elec_dn_num</span>   = chbrclf_elec_dn_num;
<span style="color: #228b22;">double</span>  <span style="color: #a0522d;">rescale_factor_kappa_ee</span>   = 1.0;
<span style="color: #228b22;">double</span>  <span style="color: #a0522d;">rescale_factor_kappa_en</span>   = 1.0;
<span style="color: #228b22;">double</span>  <span style="color: #a0522d;">nucl_rescale_factor_kappa</span> = 1.0;
<span style="color: #228b22;">double</span>* <span style="color: #a0522d;">elec_coord</span>    = &amp;(chbrclf_elec_coord[0][0][0]);

<span style="color: #228b22;">int64_t</span>  <span style="color: #a0522d;">nucl_num</span>      = chbrclf_nucl_num;
<span style="color: #228b22;">double</span>*  <span style="color: #a0522d;">charge</span>        = chbrclf_charge;
<span style="color: #228b22;">double</span>*  <span style="color: #a0522d;">nucl_coord</span>    = &amp;(chbrclf_nucl_coord[0][0]);

/* <span style="color: #b22222;">--- </span>*/

<span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #a0522d;">rc</span>;

assert(!qmckl_electron_provided(context));

<span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">n</span>;
rc = qmckl_get_electron_num (context, &amp;n);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_NOT_PROVIDED);

rc = qmckl_get_electron_up_num (context, &amp;n);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_NOT_PROVIDED);

rc = qmckl_get_electron_down_num (context, &amp;n);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_NOT_PROVIDED);


rc = qmckl_set_electron_num (context, elec_up_num, elec_dn_num);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);
assert(!qmckl_electron_provided(context));

rc = qmckl_get_electron_up_num (context, &amp;n);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);
<span style="color: #0000ff;">assert</span>(n == elec_up_num);

rc = qmckl_get_electron_down_num (context, &amp;n);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);
<span style="color: #0000ff;">assert</span>(n == elec_dn_num);

rc = qmckl_get_electron_num (context, &amp;n);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);
<span style="color: #0000ff;">assert</span>(n == elec_num);

<span style="color: #228b22;">double</span> <span style="color: #a0522d;">k_ee</span> = 0.;
<span style="color: #228b22;">double</span> <span style="color: #a0522d;">k_en</span> = 0.;
rc = qmckl_get_electron_rescale_factor_ee (context, &amp;k_ee);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);
<span style="color: #0000ff;">assert</span>(k_ee == 1.0);

rc = qmckl_get_electron_rescale_factor_en (context, &amp;k_en);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);
<span style="color: #0000ff;">assert</span>(k_en == 1.0);

rc = qmckl_set_electron_rescale_factor_en(context, rescale_factor_kappa_en);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);

rc = qmckl_set_electron_rescale_factor_ee(context, rescale_factor_kappa_ee);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);

rc = qmckl_get_electron_rescale_factor_ee (context, &amp;k_ee);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);
<span style="color: #0000ff;">assert</span>(k_ee == rescale_factor_kappa_ee);

rc = qmckl_get_electron_rescale_factor_en (context, &amp;k_en);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);
<span style="color: #0000ff;">assert</span>(k_en == rescale_factor_kappa_en);


<span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">w</span>;
rc = qmckl_get_electron_walk_num (context, &amp;w);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_NOT_PROVIDED);


rc = qmckl_set_electron_walk_num (context, walk_num);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);

rc = qmckl_get_electron_walk_num (context, &amp;w);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);
<span style="color: #0000ff;">assert</span>(w == walk_num);

<span style="color: #0000ff;">assert</span>(<span style="color: #228b22;">qmckl_electron_provided</span>(<span style="color: #a0522d;">context</span>));

rc = qmckl_set_electron_coord (context, <span style="color: #8b2252;">'N'</span>, elec_coord);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);

<span style="color: #228b22;">double</span> <span style="color: #a0522d;">elec_coord2</span>[walk_num*3*elec_num];

rc = qmckl_get_electron_coord (context, <span style="color: #8b2252;">'N'</span>, elec_coord2);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);
<span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">i</span>=0 ; i&lt;3*elec_num ; ++i) {
  assert( elec_coord[i] == elec_coord2[i] );
 }

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc91aa4e" class="outline-2">
<h2 id="orgc91aa4e"><span class="section-number-2">2</span> Computation</h2>
<div class="outline-text-2" id="text-2">
<p>
The computed data is stored in the context so that it can be reused
by different kernels. To ensure that the data is valid, for each
computed data the date of the context is stored when it is computed.
To know if some data needs to be recomputed, we check if the date of
the dependencies are more recent than the date of the data to
compute. If it is the case, then the data is recomputed and the
current date is stored.
</p>
</div>
