qmckl_electron.html

<div id="outline-container-org77c271e" class="outline-3">
<h3 id="org77c271e"><span class="section-number-3">2.1</span> Electron-electron distances</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org100be8f" class="outline-4">
<h4 id="org100be8f"><span class="section-number-4">2.1.1</span> Get</h4>
<div class="outline-text-4" id="text-2-1-1">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #0000ff;">qmckl_get_electron_ee_distance</span>(<span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>, <span style="color: #228b22;">double</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">distance</span>);
</pre>
</div>
</div>
</div>

<div id="outline-container-org8b0431e" class="outline-4">
<h4 id="org8b0431e"><span class="section-number-4">2.1.2</span> Compute</h4>
<div class="outline-text-4" id="text-2-1-2">
<table id="orgbaeb2e1" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">qmckl<sub>context</sub></td>
<td class="org-left">context</td>
<td class="org-left">in</td>
<td class="org-left">Global state</td>
</tr>

<tr>
<td class="org-left">int64<sub>t</sub></td>
<td class="org-left">elec<sub>num</sub></td>
<td class="org-left">in</td>
<td class="org-left">Number of electrons</td>
</tr>

<tr>
<td class="org-left">int64<sub>t</sub></td>
<td class="org-left">walk<sub>num</sub></td>
<td class="org-left">in</td>
<td class="org-left">Number of walkers</td>
</tr>

<tr>
<td class="org-left">double</td>
<td class="org-left">coord[walk<sub>num</sub>][3][elec<sub>num</sub>]</td>
<td class="org-left">in</td>
<td class="org-left">Electron coordinates</td>
</tr>

<tr>
<td class="org-left">double</td>
<td class="org-left">ee<sub>distance</sub>[walk<sub>num</sub>][elec<sub>num</sub>][elec<sub>num</sub>]</td>
<td class="org-left">out</td>
<td class="org-left">Electron-electron distances</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-f90"><span style="color: #228b22;">integer </span><span style="color: #a020f0;">function</span><span style="color: #a0522d;"> </span><span style="color: #0000ff;">qmckl_compute_ee_distance_f</span><span style="color: #000000; background-color: #ffffff;">(context, elec_num, walk_num, coord, ee_distance)</span><span style="color: #a0522d;"> </span><span style="color: #a020f0;">&amp;</span>
     <span style="color: #a020f0;">result</span>(info)
  <span style="color: #a020f0;">use</span> <span style="color: #0000ff;">qmckl</span>
  <span style="color: #a020f0;">implicit</span> <span style="color: #228b22;">none</span>
  <span style="color: #228b22;">integer</span>(qmckl_context), <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> context</span>
  <span style="color: #228b22;">integer</span>*8             , <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> elec_num</span>
  <span style="color: #228b22;">integer</span>*8             , <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> walk_num</span>
  <span style="color: #228b22;">double precision</span>      , <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> coord(elec_num,3,walk_num)</span>
  <span style="color: #228b22;">double precision</span>      , <span style="color: #a020f0;">intent</span>(out) ::<span style="color: #a0522d;"> ee_distance(elec_num,elec_num,walk_num)</span>

  <span style="color: #228b22;">integer</span>*8 ::<span style="color: #a0522d;"> k</span>

  info = QMCKL_SUCCESS

  <span style="color: #a020f0;">if</span> (context == QMCKL_NULL_CONTEXT) <span style="color: #a020f0;">then</span>
     info = QMCKL_INVALID_CONTEXT
     <span style="color: #a020f0;">return</span>
  <span style="color: #a020f0;">endif</span>

  <span style="color: #a020f0;">if</span> (elec_num &lt;= 0) <span style="color: #a020f0;">then</span>
     info = QMCKL_INVALID_ARG_2
     <span style="color: #a020f0;">return</span>
  <span style="color: #a020f0;">endif</span>

  <span style="color: #a020f0;">if</span> (walk_num &lt;= 0) <span style="color: #a020f0;">then</span>
     info = QMCKL_INVALID_ARG_3
     <span style="color: #a020f0;">return</span>
  <span style="color: #a020f0;">endif</span>

  <span style="color: #a020f0;">do</span> k=1,walk_num
     info = qmckl_distance(context, <span style="color: #8b2252;">'T'</span>, <span style="color: #8b2252;">'T'</span>, elec_num, elec_num, <span style="color: #a020f0;">&amp;</span>
          coord(1,1,k), elec_num, <span style="color: #a020f0;">&amp;</span>
          coord(1,1,k), elec_num, <span style="color: #a020f0;">&amp;</span>
          ee_distance(1,1,k), elec_num)
     <span style="color: #a020f0;">if</span> (info /= QMCKL_SUCCESS) <span style="color: #a020f0;">then</span>
        <span style="color: #a020f0;">exit</span>
     <span style="color: #a020f0;">endif</span>
  <span style="color: #a020f0;">end do</span>

<span style="color: #a020f0;">end function</span> <span style="color: #0000ff;">qmckl_compute_ee_distance_f</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbb5bead" class="outline-4">
<h4 id="orgbb5bead"><span class="section-number-4">2.1.3</span> Test</h4>
<div class="outline-text-4" id="text-2-1-3">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0000ff;">assert</span>(<span style="color: #228b22;">qmckl_electron_provided</span>(<span style="color: #a0522d;">context</span>));


<span style="color: #228b22;">double</span> <span style="color: #a0522d;">ee_distance</span>[walk_num * elec_num * elec_num];
rc = qmckl_get_electron_ee_distance(context, ee_distance);

// <span style="color: #b22222;">(e1,e2,w)</span>
// <span style="color: #b22222;">(0,0,0) == 0.</span>
<span style="color: #0000ff;">assert</span>(<span style="color: #228b22;">ee_distance</span>[0] == 0.);

// <span style="color: #b22222;">(1,0,0) == (0,1,0)</span>
<span style="color: #0000ff;">assert</span>(<span style="color: #228b22;">ee_distance</span>[1] == ee_distance[elec_num]);

// <span style="color: #b22222;">value of (1,0,0)</span>
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">ee_distance</span>[1]-7.152322512964209) &lt; 1.e-12);

// <span style="color: #b22222;">(0,0,1) == 0.</span>
<span style="color: #0000ff;">assert</span>(<span style="color: #228b22;">ee_distance</span>[elec_num*elec_num] == 0.);

// <span style="color: #b22222;">(1,0,1) == (0,1,1)</span>
<span style="color: #0000ff;">assert</span>(<span style="color: #228b22;">ee_distance</span>[elec_num*elec_num+1] == ee_distance[elec_num*elec_num+elec_num]);

// <span style="color: #b22222;">value of (1,0,1)</span>
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">ee_distance</span>[elec_num*elec_num+1]-6.5517646321055665) &lt; 1.e-12);

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org536fda3" class="outline-3">
<h3 id="org536fda3"><span class="section-number-3">2.2</span> Electron-electron rescaled distances</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<code>ee_distance_rescaled</code> stores the matrix of the rescaled distances between all
pairs of electrons:
</p>

<p>
\[
   C_{ij} = \left( 1 - \exp{-\kappa C_{ij}}\right)/\kappa
   \]
</p>

<p>
where \(C_{ij}\) is the matrix of electron-electron distances.
</p>
</div>
