qmckl_electron.html

<div id="outline-container-org4b5646b" class="outline-4">
<h4 id="org4b5646b"><span class="section-number-4">2.3.1</span> Get</h4>
<div class="outline-text-4" id="text-2-3-1">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #0000ff;">qmckl_get_electron_ee_distance_rescaled_deriv_e</span>(<span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>, <span style="color: #228b22;">double</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">distance_rescaled_deriv_e</span>);
</pre>
</div>
</div>
</div>

<div id="outline-container-org8150b7f" class="outline-4">
<h4 id="org8150b7f"><span class="section-number-4">2.3.2</span> Compute</h4>
<div class="outline-text-4" id="text-2-3-2">
<table id="org3f966f6" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">qmckl<sub>context</sub></td>
<td class="org-left">context</td>
<td class="org-left">in</td>
<td class="org-left">Global state</td>
</tr>

<tr>
<td class="org-left">int64<sub>t</sub></td>
<td class="org-left">elec<sub>num</sub></td>
<td class="org-left">in</td>
<td class="org-left">Number of electrons</td>
</tr>

<tr>
<td class="org-left">double</td>
<td class="org-left">rescale<sub>factor</sub><sub>kappa</sub><sub>ee</sub></td>
<td class="org-left">in</td>
<td class="org-left">Factor to rescale ee distances</td>
</tr>

<tr>
<td class="org-left">int64<sub>t</sub></td>
<td class="org-left">walk<sub>num</sub></td>
<td class="org-left">in</td>
<td class="org-left">Number of walkers</td>
</tr>

<tr>
<td class="org-left">double</td>
<td class="org-left">coord[walk<sub>num</sub>][3][elec<sub>num</sub>]</td>
<td class="org-left">in</td>
<td class="org-left">Electron coordinates</td>
</tr>

<tr>
<td class="org-left">double</td>
<td class="org-left">ee<sub>distance</sub><sub>deriv</sub><sub>e</sub>[walk<sub>num</sub>][4][elec<sub>num</sub>][elec<sub>num</sub>]</td>
<td class="org-left">out</td>
<td class="org-left">Electron-electron rescaled distance derivatives</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-f90"><span style="color: #228b22;">integer</span><span style="color: #a0522d;"> function qmckl_compute_ee_distance_rescaled_deriv_e_f(context, elec_num, rescale_factor_kappa_ee, walk_num, </span><span style="color: #a020f0;">&amp;</span>
     coord, ee_distance_rescaled_deriv_e) <span style="color: #a020f0;">&amp;</span>
     <span style="color: #a020f0;">result</span>(info)
  <span style="color: #a020f0;">use</span> <span style="color: #0000ff;">qmckl</span>
  <span style="color: #a020f0;">implicit</span> <span style="color: #228b22;">none</span>
  <span style="color: #228b22;">integer</span>(qmckl_context), <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> context</span>
  <span style="color: #228b22;">integer</span>*8             , <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> elec_num</span>
  <span style="color: #228b22;">double precision</span>      , <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> rescale_factor_kappa_ee</span>
  <span style="color: #228b22;">integer</span>*8             , <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> walk_num</span>
  <span style="color: #228b22;">double precision</span>      , <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> coord(elec_num,3,walk_num)</span>
  <span style="color: #228b22;">double precision</span>      , <span style="color: #a020f0;">intent</span>(out) ::<span style="color: #a0522d;"> ee_distance_rescaled_deriv_e(4,elec_num,elec_num,walk_num)</span>

  <span style="color: #228b22;">integer</span>*8 ::<span style="color: #a0522d;"> k</span>

  info = QMCKL_SUCCESS

  <span style="color: #a020f0;">if</span> (context == QMCKL_NULL_CONTEXT) <span style="color: #a020f0;">then</span>
     info = QMCKL_INVALID_CONTEXT
     <span style="color: #a020f0;">return</span>
  <span style="color: #a020f0;">endif</span>

  <span style="color: #a020f0;">if</span> (elec_num &lt;= 0) <span style="color: #a020f0;">then</span>
     info = QMCKL_INVALID_ARG_2
     <span style="color: #a020f0;">return</span>
  <span style="color: #a020f0;">endif</span>

  <span style="color: #a020f0;">if</span> (walk_num &lt;= 0) <span style="color: #a020f0;">then</span>
     info = QMCKL_INVALID_ARG_3
     <span style="color: #a020f0;">return</span>
  <span style="color: #a020f0;">endif</span>

  <span style="color: #a020f0;">do</span> k=1,walk_num
     info = qmckl_distance_rescaled_deriv_e(context, <span style="color: #8b2252;">'T'</span>, <span style="color: #8b2252;">'T'</span>, elec_num, elec_num, <span style="color: #a020f0;">&amp;</span>
          coord(1,1,k), elec_num, <span style="color: #a020f0;">&amp;</span>
          coord(1,1,k), elec_num, <span style="color: #a020f0;">&amp;</span>
          ee_distance_rescaled_deriv_e(1,1,1,k), elec_num, rescale_factor_kappa_ee)
     <span style="color: #a020f0;">if</span> (info /= QMCKL_SUCCESS) <span style="color: #a020f0;">then</span>
        <span style="color: #a020f0;">exit</span>
     <span style="color: #a020f0;">endif</span>
  <span style="color: #a020f0;">end do</span>

<span style="color: #a020f0;">end function</span> <span style="color: #0000ff;">qmckl_compute_ee_distance_rescaled_deriv_e_f</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7d71d8e" class="outline-4">
<h4 id="org7d71d8e"><span class="section-number-4">2.3.3</span> Test</h4>
<div class="outline-text-4" id="text-2-3-3">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0000ff;">assert</span>(<span style="color: #228b22;">qmckl_electron_provided</span>(<span style="color: #a0522d;">context</span>));


<span style="color: #228b22;">double</span> <span style="color: #a0522d;">ee_distance_rescaled_deriv_e</span>[4 * walk_num * elec_num * elec_num];
rc = qmckl_get_electron_ee_distance_rescaled_deriv_e(context, ee_distance_rescaled_deriv_e);

// <span style="color: #b22222;">TODO: Get exact values</span>
//// <span style="color: #b22222;">(e1,e2,w)</span>
//// <span style="color: #b22222;">(0,0,0) == 0.</span>
//<span style="color: #b22222;">assert(ee_distance[0] == 0.);</span>
//
//// <span style="color: #b22222;">(1,0,0) == (0,1,0)</span>
//<span style="color: #b22222;">assert(ee_distance[1] == ee_distance[elec_num]);</span>
//
//// <span style="color: #b22222;">value of (1,0,0)</span>
//<span style="color: #b22222;">assert(fabs(ee_distance[1]-7.152322512964209) &lt; 1.e-12);</span>
//
//// <span style="color: #b22222;">(0,0,1) == 0.</span>
//<span style="color: #b22222;">assert(ee_distance[elec_num*elec_num] == 0.);</span>
//
//// <span style="color: #b22222;">(1,0,1) == (0,1,1)</span>
//<span style="color: #b22222;">assert(ee_distance[elec_num*elec_num+1] == ee_distance[elec_num*elec_num+elec_num]);</span>
//
//// <span style="color: #b22222;">value of (1,0,1)</span>
//<span style="color: #b22222;">assert(fabs(ee_distance[elec_num*elec_num+1]-6.5517646321055665) &lt; 1.e-12);</span>

</pre>
</div>
</div>
</div>
</div>
