qmckl_electron.html

<div id="outline-container-org6f2c7a4" class="outline-3">
<h3 id="org6f2c7a4"><span class="section-number-3">2.4</span> Electron-nucleus distances</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-orgf5e8e8c" class="outline-4">
<h4 id="orgf5e8e8c"><span class="section-number-4">2.4.1</span> Get</h4>
<div class="outline-text-4" id="text-2-4-1">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #0000ff;">qmckl_get_electron_en_distance</span>(<span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>, <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">distance</span>);
</pre>
</div>
</div>
</div>

<div id="outline-container-org9aeff70" class="outline-4">
<h4 id="org9aeff70"><span class="section-number-4">2.4.2</span> Compute</h4>
<div class="outline-text-4" id="text-2-4-2">
<table id="orgdf5fce5" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">qmckl<sub>context</sub></td>
<td class="org-left">context</td>
<td class="org-left">in</td>
<td class="org-left">Global state</td>
</tr>

<tr>
<td class="org-left">int64<sub>t</sub></td>
<td class="org-left">elec<sub>num</sub></td>
<td class="org-left">in</td>
<td class="org-left">Number of electrons</td>
</tr>

<tr>
<td class="org-left">int64<sub>t</sub></td>
<td class="org-left">nucl<sub>num</sub></td>
<td class="org-left">in</td>
<td class="org-left">Number of nuclei</td>
</tr>

<tr>
<td class="org-left">int64<sub>t</sub></td>
<td class="org-left">walk<sub>num</sub></td>
<td class="org-left">in</td>
<td class="org-left">Number of walkers</td>
</tr>

<tr>
<td class="org-left">double</td>
<td class="org-left">elec<sub>coord</sub>[walk<sub>num</sub>][3][elec<sub>num</sub>]</td>
<td class="org-left">in</td>
<td class="org-left">Electron coordinates</td>
</tr>

<tr>
<td class="org-left">double</td>
<td class="org-left">nucl<sub>coord</sub>[3][elec<sub>num</sub>]</td>
<td class="org-left">in</td>
<td class="org-left">Nuclear coordinates</td>
</tr>

<tr>
<td class="org-left">double</td>
<td class="org-left">en<sub>distance</sub>[walk<sub>num</sub>][nucl<sub>num</sub>][elec<sub>num</sub>]</td>
<td class="org-left">out</td>
<td class="org-left">Electron-nucleus distances</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-f90"><span style="color: #228b22;">integer </span><span style="color: #a020f0;">function</span><span style="color: #a0522d;"> </span><span style="color: #0000ff;">qmckl_compute_en_distance_f</span><span style="color: #000000; background-color: #ffffff;">(context, elec_num, nucl_num, walk_num, elec_coord, nucl_coord, en_distance)</span><span style="color: #a0522d;"> </span><span style="color: #a020f0;">&amp;</span>
     <span style="color: #a020f0;">result</span>(info)
  <span style="color: #a020f0;">use</span> <span style="color: #0000ff;">qmckl</span>
  <span style="color: #a020f0;">implicit</span> <span style="color: #228b22;">none</span>
  <span style="color: #228b22;">integer</span>(qmckl_context), <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> context</span>
  <span style="color: #228b22;">integer</span>*8             , <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> elec_num</span>
  <span style="color: #228b22;">integer</span>*8             , <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> nucl_num</span>
  <span style="color: #228b22;">integer</span>*8             , <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> walk_num</span>
  <span style="color: #228b22;">double precision</span>      , <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> elec_coord(elec_num,3,walk_num)</span>
  <span style="color: #228b22;">double precision</span>      , <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> nucl_coord(nucl_num,3)</span>
  <span style="color: #228b22;">double precision</span>      , <span style="color: #a020f0;">intent</span>(out) ::<span style="color: #a0522d;"> en_distance(elec_num,nucl_num,walk_num)</span>

  <span style="color: #228b22;">integer</span>*8 ::<span style="color: #a0522d;"> k</span>

  info = QMCKL_SUCCESS

  <span style="color: #a020f0;">if</span> (context == QMCKL_NULL_CONTEXT) <span style="color: #a020f0;">then</span>
     info = QMCKL_INVALID_CONTEXT
     <span style="color: #a020f0;">return</span>
  <span style="color: #a020f0;">endif</span>

  <span style="color: #a020f0;">if</span> (elec_num &lt;= 0) <span style="color: #a020f0;">then</span>
     info = QMCKL_INVALID_ARG_2
     <span style="color: #a020f0;">return</span>
  <span style="color: #a020f0;">endif</span>

  <span style="color: #a020f0;">if</span> (nucl_num &lt;= 0) <span style="color: #a020f0;">then</span>
     info = QMCKL_INVALID_ARG_3
     <span style="color: #a020f0;">return</span>
  <span style="color: #a020f0;">endif</span>

  <span style="color: #a020f0;">if</span> (walk_num &lt;= 0) <span style="color: #a020f0;">then</span>
     info = QMCKL_INVALID_ARG_4
     <span style="color: #a020f0;">return</span>
  <span style="color: #a020f0;">endif</span>

  <span style="color: #a020f0;">do</span> k=1,walk_num
     info = qmckl_distance(context, <span style="color: #8b2252;">'T'</span>, <span style="color: #8b2252;">'T'</span>, elec_num, nucl_num, <span style="color: #a020f0;">&amp;</span>
          elec_coord(1,1,k), elec_num, <span style="color: #a020f0;">&amp;</span>
          nucl_coord, nucl_num, <span style="color: #a020f0;">&amp;</span>
          en_distance(1,1,k), elec_num)
     <span style="color: #a020f0;">if</span> (info /= QMCKL_SUCCESS) <span style="color: #a020f0;">then</span>
        <span style="color: #a020f0;">exit</span>
     <span style="color: #a020f0;">endif</span>
  <span style="color: #a020f0;">end do</span>

<span style="color: #a020f0;">end function</span> <span style="color: #0000ff;">qmckl_compute_en_distance_f</span>
</pre>
</div>
</div>
</div>
