qmckl_electron.html

<div id="outline-container-org434cb8f" class="outline-4">
<h4 id="org434cb8f"><span class="section-number-4">2.4.3</span> Test</h4>
<div class="outline-text-4" id="text-2-4-3">
<div class="org-src-container">
<pre class="src src-c">
assert(!qmckl_nucleus_provided(context));
<span style="color: #0000ff;">assert</span>(<span style="color: #228b22;">qmckl_electron_provided</span>(<span style="color: #a0522d;">context</span>));

rc = qmckl_set_nucleus_num (context, nucl_num);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);

rc = qmckl_set_nucleus_charge (context, charge);
<span style="color: #0000ff;">assert</span> (rc == QMCKL_SUCCESS);

rc = qmckl_set_nucleus_coord (context, <span style="color: #8b2252;">'T'</span>, nucl_coord);
<span style="color: #0000ff;">assert</span> (rc == QMCKL_SUCCESS);

<span style="color: #0000ff;">assert</span>(<span style="color: #228b22;">qmckl_nucleus_provided</span>(<span style="color: #a0522d;">context</span>));

<span style="color: #228b22;">double</span> <span style="color: #a0522d;">en_distance</span>[walk_num][nucl_num][elec_num];

rc = qmckl_get_electron_en_distance(context, &amp;(en_distance[0][0][0]));
<span style="color: #0000ff;">assert</span> (rc == QMCKL_SUCCESS);

// <span style="color: #b22222;">(e,n,w) in Fortran notation</span>
// <span style="color: #b22222;">(1,1,1)</span>
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">en_distance</span>[0][0][0] - 7.546738741619978) &lt; 1.e-12);

// <span style="color: #b22222;">(1,2,1)</span>
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">en_distance</span>[0][1][0] - 8.77102435246984) &lt; 1.e-12);

// <span style="color: #b22222;">(2,1,1)</span>
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">en_distance</span>[0][0][1] - 3.698922010513608) &lt; 1.e-12);

// <span style="color: #b22222;">(1,1,2)</span>
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">en_distance</span>[1][0][0] - 5.824059436060509) &lt; 1.e-12);

// <span style="color: #b22222;">(1,2,2)</span>
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">en_distance</span>[1][1][0] - 7.080482110317645) &lt; 1.e-12);

// <span style="color: #b22222;">(2,1,2)</span>
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">en_distance</span>[1][0][1] - 3.1804527583077356) &lt; 1.e-12);

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org240cf6a" class="outline-3">
<h3 id="org240cf6a"><span class="section-number-3">2.5</span> Electron-nucleus rescaled distances</h3>
<div class="outline-text-3" id="text-2-5">
<p>
<code>en_distance_rescaled</code> stores the matrix of the rescaled distances between 
electrons and nucleii.
</p>

<p>
\[
   C_{ij} = \left( 1 - \exp{-\kappa C_{ij}}\right)/\kappa
   \]
</p>

<p>
where \(C_{ij}\) is the matrix of electron-nucleus distances.
</p>
</div>
